###############################################################################
current_design csr_regfile
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Design Rules
###############################################################################
